Repository: sheilagomes/wp-trad
Catalog: tm/PHP_en-pt_BR.tmx
Source language: en
Languages: pt_br

source: See also pg_query(), pg_fetch_array(), pg_fetch_row() and pg_fetch_result().
pt_br: Veja também pg_query(), pg_fetch_array(), pg_fetch_row() e pg_fetch_result().

source: H1 Failed connecting to postgres database ?php echo $database? / H1 ?php exit; endif; $qu = pg_query ($db_conn, "SELECT * FROM verlag ORDER BY autor"); $row = 0; / / postgres needs a row counter other dbs might not while ($data = pg_fetch_object ($qu, $row)) {echo $data - autor. "("; echo $data - jahr ."):"; echo $data - titel. "BR"; $row++;}?
pt_br: H1 Falha ao conectar com o banco de dados PostgreSQL ?php echo $database? / H1 ?php exit; endif; $qu = pg_query ($db_conn, "SELECT * FROM verlag ORDER BY autor"); $row = 0; / / postgresql precisa de um contador de linha, outros dbs talvez não precisem while ($data = pg_fetch_object ($qu, $row)) {echo $data - autor. "("; echo $data - jahr ."):"; echo $data - titel. "BR"; $row++;}?

source: PRE ?php $fields[] = Array ("autor", "Author"); $fields[] = Array ("jahr", "Year"); $fields[] = Array ("titel"," Title"); $row= 0; / / postgres needs a row counter other dbs might not while ($data = pg_fetch_object ($qu, $row)) {echo "----------\n"; reset ($fields); while (list (,$item) = each ($fields)): echo $item[1] .": ".$data - $item[0] ."\n"; endwhile; $row++;} echo "----------\n";? / PRE ?php pg_free_result ($qu); pg_close ($db_conn);?
pt_br: PRE ?php $fields[] = Array ("autor", "Autor"); $fields[] = Array ("jahr", "Ano"); $fields[] = Array ("titel"," Título"); $row= 0; while ($data = pg_fetch_object ($qu, $row)) {echo "----------\n"; reset ($fields); while (list (,$item) = each ($fields)): echo $item[1] .": ".$data - $item[0] ."\n"; endwhile; $row++;} echo "----------\n";? / PRE ?php pg_free_result ($qu); pg_close ($db_conn);?

source: Calling pg_fetch_object() will increment internal row counter counter by 1.
pt_br: Ao chamar pg_fetch_object() o contador de linhas interno será acrescentado de 1.

source: The row and field specify what cell in the table of results to return.
pt_br: pg_fetch_result() retorna valores a partir de um recurso (resource) de resultado result criado por pg_query(). row é um inteiro. field é um nome de campo (string) ou um índice de campo (inteiro). row e field especificam que célula da tabela deve ser recuperada.

source: Row numbering starts from 0.
pt_br: A numeração de linhas começa de 0.

source: Instead of naming the field, you may use the field index as an unquoted number.
pt_br: Ao invés de nomear o campo, você pode usar o índice numérico de campo sem aspas.

source: Field indices start from 0.
pt_br: Índices de campo iniciam-se em 0.

source: PostgreSQL has many built in types and only the basic ones are directly supported here.
pt_br: PostgreSQL tem muitos tipos internos mas apenas os tipos básicos são suportados.

source: All forms of integer types are returned as integer values.
pt_br: Todas as formas de tipo integer são retornadas como valores integer.

source: All forms of float, and real types are returned as float All forms of float, and real types are returned as float values.
pt_br: Todas as formas de tipos reais (ponto flutuante) são retornados como valores float.

source: Boolean is returned as "t" or "f ".
pt_br: Boolean é retornado como "t" ou "f ".

source: All other types, including arrays are returned as strings formatted in the same default PostgreSQL manner that you would see in the psql program.
pt_br: Todos os outros tipos, incluindo arrays, são retornados como strings formatadas na mesma maneira padrão que o PostgreSQL retornaria com o programa psql.

source: pg_fetch_row() fetches one row of data from the result associated with the specified result resource.
pt_br: pg_fetch_row() retorna uma linha de dados a partir do resultado associado com o recurso (resource) de resultado result.

source: The row (record) is returned as an array.
pt_br: A linha (registro) é recuperada como um array.

source: It returns an array that corresponds to the fetched row, or FALSE if there are no more rows.
pt_br: Retorna um array que corresponde à linha carregada, ou FALSE se não existem mais linhas.

source: See also: pg_query(), pg_fetch_array(), pg_fetch_object() and pg_fetch_result().
pt_br: Veja também pg_query(), pg_fetch_array(), pg_fetch_object() e pg_fetch_result().

source: Postgres fetch row
pt_br: Retornando linhas (registros) no PostgreSQL

source: ?php $conn = pg_pconnect ("dbname=publisher"); if (!$conn) {echo "An error occured.\n"; exit;} $result = pg_query ($conn, "SELECT * FROM authors"); if (!$result) {echo "An error occured.\n"; exit;} while ($row = pg_fetch_row($result, $i)) {for ($j=0; $j count($row); $j++) {echo "$row[$j] nbsp ;";} echo "BR";}?
pt_br: ?php $conn = pg_pconnect ("dbname=editora"); if (!$conn) {echo "Um erro ocorreu.\n"; exit;} $result = pg_query ($conn, "SELECT * FROM autores"); if (!$result) {echo "Um erro ocorreu.\n"; exit;} $num = pg_num_rows($result); for ($i=0; $i $num; $i++) {$r = pg_fetch_row($result, $i); for ($j=0; $j count($r); $j++) {echo "$r[$j] nbsp ;";} echo "BR";}?

source: Calling pg_fetch_row() will increment internal row counter by 1.
pt_br: Ao chamar pg_fetch_row(), o contador de linha interno será incrementado em 1.

source: pg_field_is_null() test if a field is NULL or not.
pt_br: Descrição

source: It returns 1 if the field in the given row is NULL.
pt_br: pg_field_is_null() testa se um campo é NULL ou não.

source: It returns 0 if the field in the given row is NOT NULL.
pt_br: Retorna 0 se o campo na linha dada NÃO é NULL.

source: Field can be specified as column index (number) or fieldname (string).
pt_br: O campo pode ser especificado como um índice de coluna (número) ou como o nome de um campo (string).

source: Row numbering starts at 0.
pt_br: A numeração de linhas inicia-se em 0.

source: This function used to be called pg_fieldisnull().
pt_br: Esta função era chamada pg_fieldisnull().

source: pg_field_name() returns the name of the field occupying the given field_number in the given PostgreSQL result resource.
pt_br: pg_field_name() retorna o nome do campo ocupando o campo de número igual a field_number no recurso (resource) de resultado result.

source: Field numbering starts from 0.
pt_br: A numeração de campo inicia-se em 0.

source: This function used to be called pg_fieldname().
pt_br: Esta função era chamada pg_fieldname().

source: See also pg_field_num().
pt_br: Veja também pg_field_num().

source: pg_field_num() will return the number of the column (field) slot that corresponds to the field_name in the given PostgreSQL result resource.
pt_br: pg_field_num() irá retornar o número da vaga (slot) da coluna (campo) que corresponde a field_name no recurso (resource) de resultado result.

source: Field numbering starts at 0.
pt_br: A numeração de campo inicia-se em 0.

source: This function will return -1 on error.
pt_br: Esta função retornará -1 em caso de erro.

source: This function used to be called pg_fieldnum().
pt_br: Esta função era chamada pg_fieldnum().

source: See also pg_field_name().
pt_br: Veja também pg_field_name().

source: pg_field_prtlen() returns the actual printed length (number of characters) of a specific value in a PostgreSQL result.
pt_br: pg_field_prtlen() retorna o comprimento atual impresso (número de caracteres) de um valor especificado em um recurso (resource) de resultado result.

source: This function will return -1 on an error.
pt_br: Esta função retornará -1 em caso de erro.

source: This function used to be called pg_field_prtlen().
pt_br: Esta função era chamada pg_field_prtlen().

source: See also pg_field_size().
pt_br: Veja também pg_field_size().

source: pg_field_size() returns the internal storage size (in bytes) of the field number in the given PostgreSQL result.
pt_br: pg_field_size() retorna o tamanho de armazenamento interno (em bytes) do número de campo do recurso (resource) de resultado result.

source: A field size of -1 indicates a variable length field.
pt_br: Um campo de tamanho -1 indica um campo de tamanho variável.

source: This function will return FALSE on error.
pt_br: Esta função retornará FALSE em caso de erro.

source: This function used to be called pg_fieldsize().
pt_br: Esta função era chamada pg_fieldsize().

source: See also pg_field_prtlen() and pg_field_type().
pt_br: Veja também pg_field_len() e pg_field_type().

source: pg_field_type() returns a string containing the type name of the given field_number in the given PostgreSQL result resource.
pt_br: pg_field_type() retorna uma string contendo o nome do tipo do campo de número field_number dado no recurso (resource) de resultado result.

source: This function used to be called pg_fieldtype().
pt_br: Esta função era chamada pg_fieldtype().

source: See also pg_field_len() and pg_field_name().
pt_br: Veja também pg_field_len() e pg_field_name().

source: pg_free_result() only needs to be called if you are worried about using too much memory while your script is running.
pt_br: pg_free_result() precisa ser usada apenas se você está preocupado em usar muita memória enquanto seu script está rodando.

source: All result memory will automatically be freed when the script is finished.
pt_br: Todos os resultados serão liberados da memória automaticamente assim que o script terminar de executar.

source: But, if you are sure you are not going to need the result data anymore in a script, you may call pg_free_result() with the result resource as an argument and the associated result memory will be freed.
pt_br: Mas, se você tem certeza que não precisará mais dos dados do resultado em um script, você pode chamar pg_free_result() com o recurso (resource) de resultado result como argumento e a memória ocupada pelo resultado associado será liberada.

source: This function used to be called pg_freeresult().
pt_br: Esta função era chamada pg_field_len().

source: See also pg_query().
pt_br: Veja também pg_query().

source: pg_get_result() get result resource from async query executed by pg_send_query(). pg_send_query() can send multiple queries to PostgreSQL server and pg_get_result() pg_get_result() get result resource from async query executed by pg_send_query(). pg_send_query() can send multiple queries to PostgreSQL server and pg_get_result() is used to get query result one by one.
pt_br: pg_get_result() retorna o recurso (resource) de resultado de uma consulta (query) executada por ps_send_query(). pg_send_query() pode enviar múltiplas consultas (queries) ao servidor PostgreSQL e pg_get_result() é usada para carregar os resultados das consultas, um por um.

source: It returns result resource.
pt_br: Retorna o recurso (resource) de resultado.

source: If there is no more results, it returns FALSE.
pt_br: Se não houverem mais resultados, retorna FALSE.

source: pg_host() returns the host name of the given PostgreSQL connection resource is connected to.
pt_br: pg_host() retorna o nome da máquina com a qual o recurso (resource) de conexão connection está conectado.

source: See also pg_connect() and pg_pconnect().
pt_br: Veja também pg_connect() e pg_pconnect().

source: pg_insert() inserts assoc_array which has field= value into table specified as table_name.
pt_br: pg_insert() insere o array assoc_array, que contém os pares campo = valor, na tabela especificada pelo parâmetro table_name.

source: If options is specified, pg_convert() is applied to assoc_array with specified option.
pt_br: Se options for especificado, pg_convert() será aplicada à assoc_array com a opção especificada.

source: Example 1. pg_insert
pt_br: Exemplo 1. pg_insert

source: ?php $db = pg_connect ('dbname=foo'); / / This is safe, since $_POST is converted automatically $res = pg_insert($db, 'post_log', $_POST); if ($res) {echo "POST data is succesfully logged\n";} else {echo "User must have sent wrong inputs\n";}?
pt_br: ?php $db = pg_connect ('dbname=meubanco'); / / Isto é seguro uma vez que $_POST é convertido automaticamente $res = pg_insert($db, 'post_log', $_POST); if ($res) {echo "Dados POST arquivados com sucesso\n";} else {echo "O usuário deve ter inserido entradas inválidas\n";}?

source: pg_last_error() returns the last error message for given connection.
pt_br: pg_last_error() retorna a última mensagem de erro para a conexão representada por connection.

source: Error messages may be overwritten by internal PostgreSQL( libpq) function calls.
pt_br: As mensagens de erro podem ser sobrescritas por chamadas internas ao PostgreSQL( libpq).

source: It may not return appropriate error message, if multiple errors are occured inside a PostgreSQL module function.
pt_br: Se múltiplos erros ocorrerem dentro de um módulo de função do PostgreSQL, pode não retornar a mensagem de erro correta.

source: Use pg_result_error(), pg_result_status() and pg_connection_status() for better error handling.
pt_br: Use pg_result_error(), pg_result_status() e pg_connection_status() para um melhor tratamento de erros.

source: This function used to be called pg_errormessage().
pt_br: Esta função era chamada pg_errormessage().

source: See also pg_result_error().
pt_br: Veja também pg_result_error().

source: pg_last_notice() returns the last notice message from the PostgreSQL server specified by connection.
pt_br: pg_last_notice() retorna a última notificação do servidor PostgreSQL especificada por connection.

source: The PostgreSQL server sends notice messages in several cases, e.g. if the transactions can 't be continued.
pt_br: O servidor PostgreSQL envia notificações em diversas situações, por exemplo, se as transações não puderem continuar.

source: With pg_last_notice(), you can avoid issuing useless queries, by checking whether the notice is related to the transaction or not.
pt_br: Com pg_last_notice() você pode evitar a chamada de consultas (queries) inúteis, checando quando a notificação está relacionada ou não com a transação.

source: This function is EXPERIMENTAL and it is not fully implemented yet. pg_last_notice() was added in PHP 4.0.6.
pt_br: Esta função é EXPERIMENTAL e ainda não está completamente implementada. pg_last_notice() foi adicionada no PHP 4.0.6.

source: However, PHP 4.0.6 has problem with notice message handling.
pt_br: Entretanto o PHP 4.0.6 tem problemas com a manipulação de mensagens.

source: Use of the PostgreSQL module with PHP 4.0.6 is not recommended even if you are not using pg_last_notice().
pt_br: O uso do módulo PostgreSQL com o PHP 4.0.6 não é recomendada, mesmo se você não estiver usando pg_last_notice().

source: This function is fully implemented in PHP 4.3.0.
pt_br: Esta função está totalmente implementada no PHP 4.3.0.

source: PHP earlier than PHP 4.3.0 ignores database connection parameter.
pt_br: Versões do PHP mais recentes que a 4.3.0 ignoram o parâmetro de conexão com o banco de dados.

source: Notice message tracking can be set to optional by setting 1 for pgsql.ignore_notice ini from PHP 4.3.0.
pt_br: O rastreamento de notificações pode ser definido como opcional definindo 1 para a diretiva pgsql.ignore_notice do PHP 4.3.0.

source: Notice message logging can be set to optional by setting 0 for pgsql.log_notice ini from PHP 4.3.0.
pt_br: O arquivamento (log) de mensagems pode ser pode ser definido como opcional mudando para 0 a diretiva pgsql.log_notice no PHP 4.3.0.

source: Unless pgsql.ignore_notice is set to 0, notice message cannot be logged.
pt_br: A não ser que pgsql.ignore_notice estiver definida para 0, notificações não podem ser arquivadas.

source: See also pg_query() and pg_last_error().
pt_br: Veja também pg_query() e pg_last_error().

source: pg_last_oid() is used to retrieve the oid assigned to an inserted tuple (record) if the result resource is used from the last command sent via pg_query() and was an SQL INSERT.
pt_br: pg_last_oid() é usado para recuperar o oid designado a uma linha (registro) se o recurso (resource) de resultado é usado a partir do último comando enviado através de pq_query() se este comando era um INSERT do SQL.

source: Returns a positive integer if there was a valid oid.
pt_br: Retorna um inteiro positivo se havia um oid válido.

source: It returns FALSE if an error occurs or the last command sent via pg_query() was not an INSERT or INSERT is failed.
pt_br: Retorna FALSE se um erro ocorrer ou o último comando enviado através de pg_query() não foi INSERT ou se o INSERT falhou.

source: OID field became an optional field from PostgreSQL 7.2.
pt_br: O campo OID tornou-se opcional a partir do PostgreSQL 7.2.

source: When OID field is not defined in a table, programmer must use pg_result_status() to check if record is is inserted successfully or not.
pt_br: Quando um campo OID não é definido em uma tabela, o programador deve usar pg_result_status() para checar se o registro foi inserido com sucesso ou não.

source: This function used to be called pg_getlastoid().
pt_br: Esta função era chamada pg_getlastoid().

source: See also pg_query() and pg_result_status()
pt_br: Veja também pg_query() e pg_result_status()

source: pg_lo_close() closes a Large Object. large_object is a resource for the large object from pg_lo_open().
pt_br: pg_lo_close() fecha um Objeto Grande (Large Object, daí vem o "lo "que integra o nome da função). large_object é um recurso (resource) para o objeto grande gerado a partir de pg_lo_open().

source: To use the large object (lo) interface, it is necessary to enclose it within a transaction block.
pt_br: Para usar a interface de objetos grandes (lo), é necessário encapsulá-lo em um bloco de transação.

source: This function used to be called pg_loclose().
pt_br: Esta função era chamada pg_loclose().

source: See also pg_lo_open(), pg_lo_create() and pg_lo_import().
pt_br: Veja também pg_lo_open(), pg_lo_create() e pg_lo_import().

source: pg_lo_create() creates a Large Object and returns the oid of the large object. connection specifies a valid database connection opened by pg_connect() or pg_pconnect().
pt_br: pg_lo_create() cria um Objeto Grande (Large Object) e retorna o seu oid. connection especifica uma conexão a um banco de dados válida aberta por pg_connect() ou pg_pconnect().

source: PostgreSQL access modes INV_READ, INV_WRITE, and INV_ARCHIVE are not supported, the object is created always with both read and write access.
pt_br: Os modos de acesso INV_READ, INV_WRITE e INV_ARCHIVE não são suportados, o objeto é criado sempre com acesso a leitura e escrita.

source: INV_ARCHIVE has been removed from PostgreSQL itself (version 6.3 and above).
pt_br: INV_ARCHIVE foi removido do próprio PostgreSQL (a partir da 6.3).

source: It returns large object oid, otherwise it returns FALSE if an error occurred.
pt_br: Retorna FALSE se um erro ocorrer.

source: This function used to be called pg_locreate().
pt_br: Esta função era chamada pg_locreate().

source: The oid argument specifies oid of the large object to export and the pathname argument specifies the pathname of the file.
pt_br: O argumento oid especifica o oid do objeto grande (large object) a exportar e o argumento pathname O argumento oid especifica o oid do objeto grande (large object) a exportar e o argumento pathname especifica o caminho até o arquivo.

source: It returns FALSE if an error occurred, TRUE otherwise.
pt_br: Retorna FALSE se um erro ocorrer, caso contrário retorna TRUE.

source: This function used to be called pg_loexport().
pt_br: Esta função era chamada pg_loexport().

source: See also pg_lo_import().
pt_br: Veja também pg_lo_import().

source: In versions before PHP 4.2.0 the syntax of this function was different, see the following definition:
pt_br: Em versões anteriores a 4.2.0, a sintaxe desta função é diferente, veja a seguinte definição:

source: The pathname argument specifies the pathname of the file to be imported as a large object.
pt_br: O argumento pathname O argumento pathname especifica o caminho do arquivo a ser importado como um objeto grande (large object).

source: It returns FALSE if an error occurred, oid of the just created large object otherwise.
pt_br: Retorna FALSE se um erro ocorrer, caso contrário, retorna o oid do objeto recém criado.

source: This function used to be called pg_loimport().
pt_br: Esta função era chamada pg_loimport().

source: See also pg_lo_export() and pg_lo_open().
pt_br: Veja também pg_lo_export() e pg_lo_open().

source: pg_lo_open() opens a Large Object and returns large object resource.
pt_br: pg_lo_open() abre um Objeto Grande (Large Object em inglês, daí o "lo").

source: The resource encapsulates information about the connection. oid specifies a valid large object oid and mode can be either "r", "w", or "rw".
pt_br: O recurso (resource) encapsula informações sobre a conexão. oid especifica um oid de objeto grande válido e o parâmetro mode pode ser "r", "w "ou "rw".

source: It returns FALSE if there is an error.
pt_br: A função retorna FALSE se houver algum erro.

source: Do not close the database connection before closing the large object resource.
pt_br: Não feche a conexão com o banco de dados sem antes fechar a conexão com o objeto grande.

source: This function used to be called pg_loopen().
pt_br: Esta função era chamada pg_loopen().

source: See also pg_lo_close() and pg_lo_create().
pt_br: Veja também pg_lo_close() e pg_lo_create().

source: pg_lo_read_all() reads a large object and passes it straight through to the browser after sending all pending headers.
pt_br: pg_lo_read_all() lê um objeto grande (large object) e passa-o diretamente para o navegador depois de enviar todos os cabeçalhos pendentes.

source: Mainly intended for sending binary data like images or sound.
pt_br: A intenção principal é enviar dados binários como imagens ou som.

source: It returns FALSE, if an error occurred.
pt_br: Retorna o número de bytes lidos ou FALSE se ocorrer algum erro.

source: This function used to be called pg_loreadall().
pt_br: Esta função era chamada pg_loreadall().

source: See also pg_lo_read().
pt_br: Veja também pg_lo_read().

source: pg_lo_read() reads at most len bytes from a large object and returns it as a string. large_object specifies a valid large object resource and len specifies the maximum allowable size of the large object segment.
pt_br: pg_lo_read() lê o número de bytes equivalente ao valor de len de um objeto grande (large object) e retorna-o como uma string. large_object especifica um recurso (resource) válido de objeto e len especifica o tamanho máximo permitido do segmento do objeto grande.

source: This function used to be called pg_loread().
pt_br: Esta função era chamada pg_loread().

source: See also pg_lo_read_all().
pt_br: Veja também pg_lo_read_all().

source: pg_lo_seek() seeks position of large object resource. whence is PGSQL_SEEK_SET, PGSQL_SEEK_CUR or PGSQL_SEEK_END.
pt_br: pg_lo_seek() procura uma posição em um recurso (resource) de um objeto grande (large objet). whence pode ser PGSQL_SEEK_SET, PGSQL_SSEK_CUR ou PGSQL_SEEK_END.

source: See also pg_lo_tell().
pt_br: Veja também pg_lo_tell().

source: pg_lo_tell() returns current position (offset from the beginning of large object).
pt_br: pg_lo_tell() retorna a posição atual (deslocamento a partir do início do objeto grande).

source: See also pg_lo_seek().
pt_br: Veja também pg_lo_seek().

source: pg_lo_unlink() deletes a large object with the oid.
pt_br: Descrição

source: This function used to be called pg_lo_unlink().
pt_br: Esta função era chamada pg_lo_unlink().

source: See also pg_lo_create() and pg_lo_import().
pt_br: Veja também pg_lo_create() e pg_lo_import().
